import SearchBar from "./SearchBar";
import "./styles/UseAutoComplete.css";

import React, { Component } from "react";

class UseAutoComplete extends Component {
  state = {
    data: [
        {
          "id": 1,
          "name": "공인노무사"
        },
        {
          "id": 2,
          "name": "일반경비지도사"
        },
        {
          "id": 3,
          "name": "기계경비지도사"
        },
        {
          "id": 4,
          "name": "가맹거래사"
        },
        {
          "id": 5,
          "name": "관광통역안내사(불어)"
        },
        {
          "id": 6,
          "name": "관광통역안내사(독어)"
        },
        {
          "id": 7,
          "name": "관광통역안내사(스페인어)"
        },
        {
          "id": 8,
          "name": "관광통역안내사(러시아어)"
        },
        {
          "id": 9,
          "name": "관광통역안내사(일본어)"
        },
        {
          "id": 10,
          "name": "관광통역안내사(중국어)"
        },
        {
          "id": 11,
          "name": "공인중개사"
        },
        {
          "id": 12,
          "name": "관광통역안내사(이탈리아어)"
        },
        {
          "id": 13,
          "name": "관광통역안내사(태국어)"
        },
        {
          "id": 14,
          "name": "관광통역안내사(베트남어)"
        },
        {
          "id": 15,
          "name": "관광통역안내사(말레이/인도네시아어)"
        },
        {
          "id": 16,
          "name": "관광통역안내사(아랍어)"
        },
        {
          "id": 17,
          "name": "관세사"
        },
        {
          "id": 18,
          "name": "세무사"
        },
        {
          "id": 19,
          "name": "방사성동위원소취급자특수면허"
        },
        {
          "id": 20,
          "name": "방사성동위원소취급자일반면허"
        },
        {
          "id": 21,
          "name": "방사선취급감독자면허"
        },
        {
          "id": 22,
          "name": "소방안전교육사"
        },
        {
          "id": 23,
          "name": "소방시설관리사"
        },
        {
          "id": 24,
          "name": "박물관및미술관준학예사"
        },
        {
          "id": 25,
          "name": "한국어교육능력검정시험"
        },
        {
          "id": 26,
          "name": "관광통역안내사(영어)"
        },
        {
          "id": 27,
          "name": "호텔경영사"
        },
        {
          "id": 28,
          "name": "호텔관리사"
        },
        {
          "id": 29,
          "name": "국내여행안내사"
        },
        {
          "id": 30,
          "name": "호텔서비스사"
        },
        {
          "id": 31,
          "name": "문화재수리기술자(보수)"
        },
        {
          "id": 32,
          "name": "문화재수리기술자(단청)"
        },
        {
          "id": 33,
          "name": "문화재수리기술자(실측설계)"
        },
        {
          "id": 34,
          "name": "문화재수리기술자(조경)"
        },
        {
          "id": 35,
          "name": "문화재수리기술자(보존과학)"
        },
        {
          "id": 36,
          "name": "문화재수리기술자(식물보호)"
        },
        {
          "id": 37,
          "name": "문화재수리기능자(대목수)"
        },
        {
          "id": 38,
          "name": "문화재수리기능자(소목수)"
        },
        {
          "id": 39,
          "name": "문화재수리기능자(가공석공)"
        },
        {
          "id": 40,
          "name": "문화재수리기능자(쌓기석공)"
        },
        {
          "id": 41,
          "name": "문화재수리기능자(화공)"
        },
        {
          "id": 42,
          "name": "문화재수리기능자(드잡이공)"
        },
        {
          "id": 43,
          "name": "문화재수리기능자(번와와공)"
        },
        {
          "id": 44,
          "name": "문화재수리기능자(제작와공)"
        },
        {
          "id": 45,
          "name": "문화재수리기능자(한식미장공)"
        },
        {
          "id": 46,
          "name": "문화재수리기능자(철물공)"
        },
        {
          "id": 47,
          "name": "문화재수리기능자(목조각공)"
        },
        {
          "id": 48,
          "name": "문화재수리기능자(석조각공)"
        },
        {
          "id": 49,
          "name": "문화재수리기능자(칠공)"
        },
        {
          "id": 50,
          "name": "문화재수리기능자(도금공)"
        },
        {
          "id": 51,
          "name": "문화재수리기능자(표구공)"
        },
        {
          "id": 52,
          "name": "문화재수리기능자(조경공)"
        },
        {
          "id": 53,
          "name": "문화재수리기능자(세척공)"
        },
        {
          "id": 54,
          "name": "문화재수리기능자(훈증공)"
        },
        {
          "id": 55,
          "name": "문화재수리기능자(보존처리공)"
        },
        {
          "id": 56,
          "name": "문화재수리기능자(식물보호공)"
        },
        {
          "id": 57,
          "name": "문화재수리기능자(실측설계사보)"
        },
        {
          "id": 58,
          "name": "문화재수리기능자(박제및표본제작공)"
        },
        {
          "id": 59,
          "name": "문화재수리기능자(온돌공)"
        },
        {
          "id": 60,
          "name": "농산물품질관리사"
        },
        {
          "id": 61,
          "name": "경매사(청과)"
        },
        {
          "id": 62,
          "name": "경매사(수산)"
        },
        {
          "id": 63,
          "name": "경매사(축산)"
        },
        {
          "id": 64,
          "name": "경매사(화훼)"
        },
        {
          "id": 65,
          "name": "경매사(약용)"
        },
        {
          "id": 66,
          "name": "경영지도사(인적자원관리)"
        },
        {
          "id": 67,
          "name": "경영지도사(재무관리)"
        },
        {
          "id": 68,
          "name": "경영지도사(생산관리)"
        },
        {
          "id": 69,
          "name": "경영지도사(마케팅)"
        },
        {
          "id": 70,
          "name": "경영지도사(1차공통)"
        },
        {
          "id": 71,
          "name": "문화재수리기능자(모사공)"
        },
        {
          "id": 72,
          "name": "산업안전지도사(기계안전)"
        },
        {
          "id": 73,
          "name": "산업안전지도사(전기안전)"
        },
        {
          "id": 74,
          "name": "산업안전지도사(화공안전)"
        },
        {
          "id": 75,
          "name": "산업안전지도사(건설안전)"
        },
        {
          "id": 76,
          "name": "산업보건지도사(직업환경의학)"
        },
        {
          "id": 77,
          "name": "산업보건지도사(산업위생공학)"
        },
        {
          "id": 78,
          "name": "일반행정사"
        },
        {
          "id": 79,
          "name": "외국어번역행정사"
        },
        {
          "id": 80,
          "name": "기술행정사"
        },
        {
          "id": 81,
          "name": "경매사(양곡)"
        },
        {
          "id": 82,
          "name": "기술지도사(1차공통)"
        },
        {
          "id": 83,
          "name": "기술지도사(기계)"
        },
        {
          "id": 84,
          "name": "기술지도사(금속)"
        },
        {
          "id": 85,
          "name": "기술지도사(전기전자)"
        },
        {
          "id": 86,
          "name": "기술지도사(섬유)"
        },
        {
          "id": 87,
          "name": "기술지도사(화공)"
        },
        {
          "id": 88,
          "name": "기술지도사(생산관리)"
        },
        {
          "id": 89,
          "name": "기술지도사(정보처리)"
        },
        {
          "id": 90,
          "name": "변리사"
        },
        {
          "id": 91,
          "name": "사회복지사 1급"
        },
        {
          "id": 92,
          "name": "정수시설운영관리사1급"
        },
        {
          "id": 93,
          "name": "정수시설운영관리사2급"
        },
        {
          "id": 94,
          "name": "정수시설운영관리사3급"
        },
        {
          "id": 95,
          "name": "주택관리사보"
        },
        {
          "id": 96,
          "name": "감정평가사"
        },
        {
          "id": 97,
          "name": "물류관리사"
        },
        {
          "id": 98,
          "name": "검수사"
        },
        {
          "id": 99,
          "name": "검량사"
        },
        {
          "id": 100,
          "name": "감정사"
        },
        {
          "id": 101,
          "name": "1급 청소년지도사"
        },
        {
          "id": 102,
          "name": "2급 청소년지도사"
        },
        {
          "id": 103,
          "name": "3급 청소년지도사"
        },
        {
          "id": 104,
          "name": "1급 청소년상담사"
        },
        {
          "id": 105,
          "name": "2급 청소년상담사"
        },
        {
          "id": 106,
          "name": "3급 청소년상담사"
        },
        {
          "id": 107,
          "name": "기술지도사(환경)"
        },
        {
          "id": 108,
          "name": "기술지도사(생명공학)"
        },
        {
          "id": 109,
          "name": "수산물품질관리사"
        },
        {
          "id": 110,
          "name": "손해평가사"
        },
        {
          "id": 111,
          "name": "고용노동부 보건직(7급)"
        },
        {
          "id": 112,
          "name": "용접기술사"
        },
        {
          "id": 113,
          "name": "금형기술사"
        },
        {
          "id": 114,
          "name": "차량기술사"
        },
        {
          "id": 115,
          "name": "산업기계설비기술사"
        },
        {
          "id": 116,
          "name": "공조냉동기계기술사"
        },
        {
          "id": 117,
          "name": "건설기계기술사"
        },
        {
          "id": 118,
          "name": "금속제련기술사"
        },
        {
          "id": 119,
          "name": "금속재료기술사"
        },
        {
          "id": 120,
          "name": "표면처리기술사"
        },
        {
          "id": 121,
          "name": "금속가공기술사"
        },
        {
          "id": 122,
          "name": "화공기술사"
        },
        {
          "id": 123,
          "name": "발송배전기술사"
        },
        {
          "id": 124,
          "name": "전기응용기술사"
        },
        {
          "id": 125,
          "name": "철도신호기술사"
        },
        {
          "id": 126,
          "name": "산업계측제어기술사"
        },
        {
          "id": 127,
          "name": "전자응용기술사"
        },
        {
          "id": 128,
          "name": "조선기술사"
        },
        {
          "id": 129,
          "name": "항공기체기술사"
        },
        {
          "id": 130,
          "name": "항공기관기술사"
        },
        {
          "id": 131,
          "name": "토질및기초기술사"
        },
        {
          "id": 132,
          "name": "토목구조기술사"
        },
        {
          "id": 133,
          "name": "항만및해안기술사"
        },
        {
          "id": 134,
          "name": "도로및공항기술사"
        },
        {
          "id": 135,
          "name": "철도기술사"
        },
        {
          "id": 136,
          "name": "철도차량기술사"
        },
        {
          "id": 137,
          "name": "전기철도기술사"
        },
        {
          "id": 138,
          "name": "수자원개발기술사"
        },
        {
          "id": 139,
          "name": "상하수도기술사"
        },
        {
          "id": 140,
          "name": "농어업토목기술사"
        },
        {
          "id": 141,
          "name": "토목시공기술사"
        },
        {
          "id": 142,
          "name": "토목품질시험기술사"
        },
        {
          "id": 143,
          "name": "건축구조기술사"
        },
        {
          "id": 144,
          "name": "건축기계설비기술사"
        },
        {
          "id": 145,
          "name": "건축전기설비기술사"
        },
        {
          "id": 146,
          "name": "건축시공기술사"
        },
        {
          "id": 147,
          "name": "건축품질시험기술사"
        },
        {
          "id": 148,
          "name": "섬유기술사"
        },
        {
          "id": 149,
          "name": "의류기술사"
        },
        {
          "id": 150,
          "name": "자원관리기술사"
        },
        {
          "id": 151,
          "name": "광해방지기술사"
        },
        {
          "id": 152,
          "name": "화약류관리기술사"
        },
        {
          "id": 153,
          "name": "정보관리기술사"
        },
        {
          "id": 154,
          "name": "컴퓨터시스템응용기술사"
        },
        {
          "id": 155,
          "name": "도시계획기술사"
        },
        {
          "id": 156,
          "name": "조경기술사"
        },
        {
          "id": 157,
          "name": "측량및지형공간정보기술사"
        },
        {
          "id": 158,
          "name": "지적기술사"
        },
        {
          "id": 159,
          "name": "해양기술사"
        },
        {
          "id": 160,
          "name": "수산양식기술사"
        },
        {
          "id": 161,
          "name": "어로기술사"
        },
        {
          "id": 162,
          "name": "기계안전기술사"
        },
        {
          "id": 163,
          "name": "화공안전기술사"
        },
        {
          "id": 164,
          "name": "전기안전기술사"
        },
        {
          "id": 165,
          "name": "건설안전기술사"
        },
        {
          "id": 166,
          "name": "소방기술사"
        },
        {
          "id": 167,
          "name": "산업위생관리기술사"
        },
        {
          "id": 168,
          "name": "가스기술사"
        },
        {
          "id": 169,
          "name": "공장관리기술사"
        },
        {
          "id": 170,
          "name": "품질관리기술사"
        },
        {
          "id": 171,
          "name": "포장기술사"
        },
        {
          "id": 172,
          "name": "세라믹기술사"
        },
        {
          "id": 173,
          "name": "식품기술사"
        },
        {
          "id": 174,
          "name": "산림기술사"
        },
        {
          "id": 175,
          "name": "비파괴검사기술사"
        },
        {
          "id": 176,
          "name": "수산제조기술사"
        },
        {
          "id": 177,
          "name": "지질및지반기술사"
        },
        {
          "id": 178,
          "name": "종자기술사"
        },
        {
          "id": 179,
          "name": "시설원예기술사"
        },
        {
          "id": 180,
          "name": "축산기술사"
        },
        {
          "id": 181,
          "name": "기계기술사"
        },
        {
          "id": 182,
          "name": "인간공학기술사"
        },
        {
          "id": 183,
          "name": "기상예보기술사"
        },
        {
          "id": 184,
          "name": "대기관리기술사"
        },
        {
          "id": 185,
          "name": "수질관리기술사"
        },
        {
          "id": 186,
          "name": "자연환경관리기술사"
        },
        {
          "id": 187,
          "name": "소음진동기술사"
        },
        {
          "id": 188,
          "name": "토양환경기술사"
        },
        {
          "id": 189,
          "name": "농화학기술사"
        },
        {
          "id": 190,
          "name": "교통기술사"
        },
        {
          "id": 191,
          "name": "제품디자인기술사"
        },
        {
          "id": 192,
          "name": "폐기물처리기술사"
        },
        {
          "id": 193,
          "name": "일반기계기사"
        },
        {
          "id": 194,
          "name": "용접기사"
        },
        {
          "id": 195,
          "name": "농업기계기사"
        },
        {
          "id": 196,
          "name": "사출금형설계기사"
        },
        {
          "id": 197,
          "name": "프레스금형설계기사"
        },
        {
          "id": 198,
          "name": "그린전동자동차기사"
        },
        {
          "id": 199,
          "name": "온실가스관리기사"
        },
        {
          "id": 200,
          "name": "환경위해관리기사"
        },
        {
          "id": 201,
          "name": "철도차량기사"
        },
        {
          "id": 202,
          "name": "건설기계설비기사"
        },
        {
          "id": 203,
          "name": "콘크리트기사"
        },
        {
          "id": 204,
          "name": "건설기계정비기사"
        },
        {
          "id": 205,
          "name": "궤도장비정비기사"
        },
        {
          "id": 206,
          "name": "메카트로닉스기사"
        },
        {
          "id": 207,
          "name": "자동차정비기사"
        },
        {
          "id": 208,
          "name": "기계설계기사"
        },
        {
          "id": 209,
          "name": "금속재료기사"
        },
        {
          "id": 210,
          "name": "화공기사"
        },
        {
          "id": 211,
          "name": "신재생에너지발전설비기사(태양광)"
        },
        {
          "id": 212,
          "name": "임베디드기사"
        },
        {
          "id": 213,
          "name": "화약류제조기사"
        },
        {
          "id": 214,
          "name": "화약류관리기사"
        },
        {
          "id": 215,
          "name": "전기기사"
        },
        {
          "id": 216,
          "name": "전기공사기사"
        },
        {
          "id": 217,
          "name": "전자기사"
        },
        {
          "id": 218,
          "name": "반도체설계기사"
        },
        {
          "id": 219,
          "name": "의공기사"
        },
        {
          "id": 220,
          "name": "로봇기구개발기사"
        },
        {
          "id": 221,
          "name": "로봇소프트웨어개발기사"
        },
        {
          "id": 222,
          "name": "로봇하드웨어개발기사"
        },
        {
          "id": 223,
          "name": "전파전자통신기사"
        },
        {
          "id": 224,
          "name": "조선기사"
        },
        {
          "id": 225,
          "name": "항공기사"
        },
        {
          "id": 226,
          "name": "토목기사"
        },
        {
          "id": 227,
          "name": "실내건축기사"
        },
        {
          "id": 228,
          "name": "섬유기사"
        },
        {
          "id": 229,
          "name": "의류기사"
        },
        {
          "id": 230,
          "name": "정보처리기사"
        },
        {
          "id": 231,
          "name": "전자계산기기사"
        },
        {
          "id": 232,
          "name": "전자계산기조직응용기사"
        },
        {
          "id": 233,
          "name": "정보보안기사"
        },
        {
          "id": 234,
          "name": "에너지관리기사"
        },
        {
          "id": 235,
          "name": "도시계획기사"
        },
        {
          "id": 236,
          "name": "항로표지기사"
        },
        {
          "id": 237,
          "name": "조경기사"
        },
        {
          "id": 238,
          "name": "측량및지형공간정보기사"
        },
        {
          "id": 239,
          "name": "지적기사"
        },
        {
          "id": 240,
          "name": "인쇄기사"
        },
        {
          "id": 241,
          "name": "해양환경기사"
        },
        {
          "id": 242,
          "name": "해양자원개발기사"
        },
        {
          "id": 243,
          "name": "해양공학기사"
        },
        {
          "id": 244,
          "name": "산업안전기사"
        },
        {
          "id": 245,
          "name": "건설안전기사"
        },
        {
          "id": 246,
          "name": "화재감식평가기사"
        },
        {
          "id": 247,
          "name": "농작업안전보건기사"
        },
        {
          "id": 248,
          "name": "방재기사"
        },
        {
          "id": 249,
          "name": "광산보안기사"
        },
        {
          "id": 250,
          "name": "가스기사"
        },
        {
          "id": 251,
          "name": "산업위생관리기사"
        },
        {
          "id": 252,
          "name": "품질경영기사"
        },
        {
          "id": 253,
          "name": "포장기사"
        },
        {
          "id": 254,
          "name": "제품디자인기사"
        },
        {
          "id": 255,
          "name": "광학기사"
        },
        {
          "id": 256,
          "name": "식품기사"
        },
        {
          "id": 257,
          "name": "수산제조기사"
        },
        {
          "id": 258,
          "name": "식육가공기사"
        },
        {
          "id": 259,
          "name": "응용지질기사"
        },
        {
          "id": 260,
          "name": "승강기기사"
        },
        {
          "id": 261,
          "name": "종자기사"
        },
        {
          "id": 262,
          "name": "식물보호기사"
        },
        {
          "id": 263,
          "name": "화학분석기사"
        },
        {
          "id": 264,
          "name": "산림기사"
        },
        {
          "id": 265,
          "name": "임업종묘기사"
        },
        {
          "id": 266,
          "name": "광해방지기사"
        },
        {
          "id": 267,
          "name": "화훼장식기사"
        },
        {
          "id": 268,
          "name": "축산기사"
        },
        {
          "id": 269,
          "name": "임산가공기사"
        },
        {
          "id": 270,
          "name": "유기농업기사"
        },
        {
          "id": 271,
          "name": "기상기사"
        },
        {
          "id": 272,
          "name": "기상감정기사"
        },
        {
          "id": 273,
          "name": "방사선비파괴검사기사"
        },
        {
          "id": 274,
          "name": "초음파비파괴검사기사"
        },
        {
          "id": 275,
          "name": "자기비파괴검사기사"
        },
        {
          "id": 276,
          "name": "침투비파괴검사기사"
        },
        {
          "id": 277,
          "name": "와전류비파괴검사기사"
        },
        {
          "id": 278,
          "name": "누설비파괴검사기사"
        },
        {
          "id": 279,
          "name": "수산양식기사"
        },
        {
          "id": 280,
          "name": "건축기사"
        },
        {
          "id": 281,
          "name": "건축설비기사"
        },
        {
          "id": 282,
          "name": "어업생산관리기사"
        },
        {
          "id": 283,
          "name": "버섯산업기사"
        },
        {
          "id": 284,
          "name": "대기환경기사"
        },
        {
          "id": 285,
          "name": "수질환경기사"
        },
        {
          "id": 286,
          "name": "소음진동기사"
        },
        {
          "id": 287,
          "name": "공조냉동기계기사"
        },
        {
          "id": 288,
          "name": "철도신호기사"
        },
        {
          "id": 289,
          "name": "전기철도기사"
        },
        {
          "id": 290,
          "name": "건설재료시험기사"
        },
        {
          "id": 291,
          "name": "교통기사"
        },
        {
          "id": 292,
          "name": "철도토목기사"
        },
        {
          "id": 293,
          "name": "시설원예기사"
        },
        {
          "id": 294,
          "name": "시각디자인기사"
        },
        {
          "id": 295,
          "name": "바이오화학제품제조기사"
        },
        {
          "id": 296,
          "name": "설비보전기사"
        },
        {
          "id": 297,
          "name": "인간공학기사"
        },
        {
          "id": 298,
          "name": "소방설비기사(기계분야)"
        },
        {
          "id": 299,
          "name": "소방설비기사(전기분야)"
        },
        {
          "id": 300,
          "name": "자연생태복원기사"
        },
        {
          "id": 301,
          "name": "토양환경기사"
        },
        {
          "id": 302,
          "name": "폐기물처리기사"
        },
        {
          "id": 303,
          "name": "컬러리스트기사"
        },
        {
          "id": 304,
          "name": "생물분류기사(식물)"
        },
        {
          "id": 305,
          "name": "생물분류기사(동물)"
        },
        {
          "id": 306,
          "name": "기계조립산업기사"
        },
        {
          "id": 307,
          "name": "판금제관산업기사"
        },
        {
          "id": 308,
          "name": "컴퓨터응용가공산업기사"
        },
        {
          "id": 309,
          "name": "용접산업기사"
        },
        {
          "id": 310,
          "name": "농업기계산업기사"
        },
        {
          "id": 311,
          "name": "사출금형산업기사"
        },
        {
          "id": 312,
          "name": "프레스금형산업기사"
        },
        {
          "id": 313,
          "name": "철도차량산업기사"
        },
        {
          "id": 314,
          "name": "기계설계산업기사"
        },
        {
          "id": 315,
          "name": "생산자동화산업기사"
        },
        {
          "id": 316,
          "name": "기계정비산업기사"
        },
        {
          "id": 317,
          "name": "전기철도산업기사"
        },
        {
          "id": 318,
          "name": "온실가스관리산업기사"
        },
        {
          "id": 319,
          "name": "건설기계설비산업기사"
        },
        {
          "id": 320,
          "name": "배관산업기사"
        },
        {
          "id": 321,
          "name": "철도운송산업기사"
        },
        {
          "id": 322,
          "name": "영사산업기사"
        },
        {
          "id": 323,
          "name": "콘크리트산업기사"
        },
        {
          "id": 324,
          "name": "건설기계정비산업기사"
        },
        {
          "id": 325,
          "name": "궤도장비정비산업기사"
        },
        {
          "id": 326,
          "name": "자동차정비산업기사"
        },
        {
          "id": 327,
          "name": "패션머천다이징산업기사"
        },
        {
          "id": 328,
          "name": "치공구설계산업기사"
        },
        {
          "id": 329,
          "name": "금속재료산업기사"
        },
        {
          "id": 330,
          "name": "정밀측정산업기사"
        },
        {
          "id": 331,
          "name": "주조산업기사"
        },
        {
          "id": 332,
          "name": "표면처리산업기사"
        },
        {
          "id": 333,
          "name": "재료조직평가산업기사"
        },
        {
          "id": 334,
          "name": "광학기기산업기사"
        },
        {
          "id": 335,
          "name": "신재생에너지발전설비산업기사(태양광)"
        },
        {
          "id": 336,
          "name": "화약류제조산업기사"
        },
        {
          "id": 337,
          "name": "위험물산업기사"
        },
        {
          "id": 338,
          "name": "화약류관리산업기사"
        },
        {
          "id": 339,
          "name": "광산보안산업기사"
        },
        {
          "id": 340,
          "name": "전기산업기사"
        },
        {
          "id": 341,
          "name": "가구제작산업기사"
        },
        {
          "id": 342,
          "name": "전기공사산업기사"
        },
        {
          "id": 343,
          "name": "철도신호산업기사"
        },
        {
          "id": 344,
          "name": "전자산업기사"
        },
        {
          "id": 345,
          "name": "반도체설계산업기사"
        },
        {
          "id": 346,
          "name": "의공산업기사"
        },
        {
          "id": 347,
          "name": "3D프린터개발산업기사"
        },
        {
          "id": 348,
          "name": "사무자동화산업기사"
        },
        {
          "id": 349,
          "name": "전파전자통신산업기사"
        },
        {
          "id": 350,
          "name": "조선산업기사"
        },
        {
          "id": 351,
          "name": "항공산업기사"
        },
        {
          "id": 352,
          "name": "토목산업기사"
        },
        {
          "id": 353,
          "name": "건축일반시공산업기사"
        },
        {
          "id": 354,
          "name": "건축목공산업기사"
        },
        {
          "id": 355,
          "name": "섬유디자인산업기사"
        },
        {
          "id": 356,
          "name": "한복산업기사"
        },
        {
          "id": 357,
          "name": "섬유산업기사"
        },
        {
          "id": 358,
          "name": "실내건축산업기사"
        },
        {
          "id": 359,
          "name": "정보처리산업기사"
        },
        {
          "id": 360,
          "name": "패션디자인산업기사"
        },
        {
          "id": 361,
          "name": "신발산업기사"
        },
        {
          "id": 362,
          "name": "조경산업기사"
        },
        {
          "id": 363,
          "name": "전자계산기제어산업기사"
        },
        {
          "id": 364,
          "name": "정보보안산업기사"
        },
        {
          "id": 365,
          "name": "측량및지형공간정보산업기사"
        },
        {
          "id": 366,
          "name": "지적산업기사"
        },
        {
          "id": 367,
          "name": "해양조사산업기사"
        },
        {
          "id": 368,
          "name": "항로표지산업기사"
        },
        {
          "id": 369,
          "name": "산업안전산업기사"
        },
        {
          "id": 370,
          "name": "건설안전산업기사"
        },
        {
          "id": 371,
          "name": "인쇄산업기사"
        },
        {
          "id": 372,
          "name": "승강기산업기사"
        },
        {
          "id": 373,
          "name": "품질경영산업기사"
        },
        {
          "id": 374,
          "name": "포장산업기사"
        },
        {
          "id": 375,
          "name": "제품디자인산업기사"
        },
        {
          "id": 376,
          "name": "시각디자인산업기사"
        },
        {
          "id": 377,
          "name": "화재감식평가산업기사"
        },
        {
          "id": 378,
          "name": "식품산업기사"
        },
        {
          "id": 379,
          "name": "종자산업기사"
        },
        {
          "id": 380,
          "name": "가스산업기사"
        },
        {
          "id": 381,
          "name": "산업위생관리산업기사"
        },
        {
          "id": 382,
          "name": "산림산업기사"
        },
        {
          "id": 383,
          "name": "축산산업기사"
        },
        {
          "id": 384,
          "name": "임산가공산업기사"
        },
        {
          "id": 385,
          "name": "수산양식산업기사"
        },
        {
          "id": 386,
          "name": "잠수산업기사"
        },
        {
          "id": 387,
          "name": "건축산업기사"
        },
        {
          "id": 388,
          "name": "건축설비산업기사"
        },
        {
          "id": 389,
          "name": "피아노조율산업기사"
        },
        {
          "id": 390,
          "name": "식물보호산업기사"
        },
        {
          "id": 391,
          "name": "바이오화학제품제조산업기사"
        },
        {
          "id": 392,
          "name": "대기환경산업기사"
        },
        {
          "id": 393,
          "name": "수질환경산업기사"
        },
        {
          "id": 394,
          "name": "소음진동산업기사"
        },
        {
          "id": 395,
          "name": "농림토양평가관리산업기사"
        },
        {
          "id": 396,
          "name": "공조냉동기계산업기사"
        },
        {
          "id": 397,
          "name": "유기농업산업기사"
        },
        {
          "id": 398,
          "name": "건설재료시험산업기사"
        },
        {
          "id": 399,
          "name": "철도토목산업기사"
        },
        {
          "id": 400,
          "name": "방사선비파괴검사산업기사"
        },
        {
          "id": 401,
          "name": "초음파비파괴검사산업기사"
        },
        {
          "id": 402,
          "name": "자기비파괴검사산업기사"
        },
        {
          "id": 403,
          "name": "침투비파괴검사산업기사"
        },
        {
          "id": 404,
          "name": "화훼장식산업기사"
        },
        {
          "id": 405,
          "name": "방수산업기사"
        },
        {
          "id": 406,
          "name": "어로산업기사"
        },
        {
          "id": 407,
          "name": "교통산업기사"
        },
        {
          "id": 408,
          "name": "귀금속가공산업기사"
        },
        {
          "id": 409,
          "name": "전자부품장착산업기사"
        },
        {
          "id": 410,
          "name": "보석디자인산업기사"
        },
        {
          "id": 411,
          "name": "소방설비산업기사(기계분야)"
        },
        {
          "id": 412,
          "name": "소방설비산업기사(전기분야)"
        },
        {
          "id": 413,
          "name": "자연생태복원산업기사"
        },
        {
          "id": 414,
          "name": "폐기물처리산업기사"
        },
        {
          "id": 415,
          "name": "에너지관리산업기사"
        },
        {
          "id": 416,
          "name": "한식조리산업기사"
        },
        {
          "id": 417,
          "name": "양식조리산업기사"
        },
        {
          "id": 418,
          "name": "일식조리산업기사"
        },
        {
          "id": 419,
          "name": "중식조리산업기사"
        },
        {
          "id": 420,
          "name": "복어조리산업기사"
        },
        {
          "id": 421,
          "name": "보석감정산업기사"
        },
        {
          "id": 422,
          "name": "컬러리스트산업기사"
        },
        {
          "id": 423,
          "name": "기계가공기능장"
        },
        {
          "id": 424,
          "name": "금형제작기능장"
        },
        {
          "id": 425,
          "name": "배관기능장"
        },
        {
          "id": 426,
          "name": "판금제관기능장"
        },
        {
          "id": 427,
          "name": "용접기능장"
        },
        {
          "id": 428,
          "name": "자동차정비기능장"
        },
        {
          "id": 429,
          "name": "건설기계정비기능장"
        },
        {
          "id": 430,
          "name": "철도차량정비기능장"
        },
        {
          "id": 431,
          "name": "에너지관리기능장"
        },
        {
          "id": 432,
          "name": "주조기능장"
        },
        {
          "id": 433,
          "name": "표면처리기능장"
        },
        {
          "id": 434,
          "name": "금속재료기능장"
        },
        {
          "id": 435,
          "name": "제선기능장"
        },
        {
          "id": 436,
          "name": "제강기능장"
        },
        {
          "id": 437,
          "name": "압연기능장"
        },
        {
          "id": 438,
          "name": "위험물기능장"
        },
        {
          "id": 439,
          "name": "가스기능장"
        },
        {
          "id": 440,
          "name": "전기기능장"
        },
        {
          "id": 441,
          "name": "전자기기기능장"
        },
        {
          "id": 442,
          "name": "건축목재시공기능장"
        },
        {
          "id": 443,
          "name": "건축일반시공기능장"
        },
        {
          "id": 444,
          "name": "귀금속가공기능장"
        },
        {
          "id": 445,
          "name": "잠수기능장"
        },
        {
          "id": 446,
          "name": "조리기능장"
        },
        {
          "id": 447,
          "name": "제과기능장"
        },
        {
          "id": 448,
          "name": "미용장"
        },
        {
          "id": 449,
          "name": "이용장"
        },
        {
          "id": 450,
          "name": "컴퓨터응용선반기능사"
        },
        {
          "id": 451,
          "name": "컴퓨터응용밀링기능사"
        },
        {
          "id": 452,
          "name": "반도체장비유지보수기능사"
        },
        {
          "id": 453,
          "name": "연삭기능사"
        },
        {
          "id": 454,
          "name": "기계가공조립기능사"
        },
        {
          "id": 455,
          "name": "궤도장비정비기능사"
        },
        {
          "id": 456,
          "name": "금형기능사"
        },
        {
          "id": 457,
          "name": "정밀측정기능사"
        },
        {
          "id": 458,
          "name": "전산응용기계제도기능사"
        },
        {
          "id": 459,
          "name": "판금제관기능사"
        },
        {
          "id": 460,
          "name": "의료전자기능사"
        },
        {
          "id": 461,
          "name": "배관기능사"
        },
        {
          "id": 462,
          "name": "특수용접기능사"
        },
        {
          "id": 463,
          "name": "용접기능사"
        },
        {
          "id": 464,
          "name": "공유압기능사"
        },
        {
          "id": 465,
          "name": "자동차정비기능사"
        },
        {
          "id": 466,
          "name": "자동차차체수리기능사"
        },
        {
          "id": 467,
          "name": "항공기체정비기능사"
        },
        {
          "id": 468,
          "name": "항공기관정비기능사"
        },
        {
          "id": 469,
          "name": "항공장비정비기능사"
        },
        {
          "id": 470,
          "name": "항공전자정비기능사"
        },
        {
          "id": 471,
          "name": "건설기계정비기능사"
        },
        {
          "id": 472,
          "name": "농기계정비기능사"
        },
        {
          "id": 473,
          "name": "농기계운전기능사"
        },
        {
          "id": 474,
          "name": "공조냉동기계기능사"
        },
        {
          "id": 475,
          "name": "가스기능사"
        },
        {
          "id": 476,
          "name": "항로표지기능사"
        },
        {
          "id": 477,
          "name": "철도차량정비기능사"
        },
        {
          "id": 478,
          "name": "축로기능사"
        },
        {
          "id": 479,
          "name": "생산자동화기능사"
        },
        {
          "id": 480,
          "name": "열처리기능사"
        },
        {
          "id": 481,
          "name": "주조기능사"
        },
        {
          "id": 482,
          "name": "표면처리기능사"
        },
        {
          "id": 483,
          "name": "금속재료시험기능사"
        },
        {
          "id": 484,
          "name": "제선기능사"
        },
        {
          "id": 485,
          "name": "제강기능사"
        },
        {
          "id": 486,
          "name": "원형기능사"
        },
        {
          "id": 487,
          "name": "압연기능사"
        },
        {
          "id": 488,
          "name": "화학분석기능사"
        },
        {
          "id": 489,
          "name": "유기농업기능사"
        },
        {
          "id": 490,
          "name": "위험물기능사"
        },
        {
          "id": 491,
          "name": "철도전기신호기능사"
        },
        {
          "id": 492,
          "name": "전자캐드기능사"
        },
        {
          "id": 493,
          "name": "전자기기기능사"
        },
        {
          "id": 494,
          "name": "전자출판기능사"
        },
        {
          "id": 495,
          "name": "석공예기능사"
        },
        {
          "id": 496,
          "name": "제품응용모델링기능사"
        },
        {
          "id": 497,
          "name": "전자계산기기능사"
        },
        {
          "id": 498,
          "name": "전자부품장착기능사"
        },
        {
          "id": 499,
          "name": "자동차보수도장기능사"
        },
        {
          "id": 500,
          "name": "설비보전기능사"
        },
        {
          "id": 501,
          "name": "정보기기운용기능사"
        },
        {
          "id": 502,
          "name": "전파전자통신기능사"
        },
        {
          "id": 503,
          "name": "전산응용조선제도기능사"
        },
        {
          "id": 504,
          "name": "선체건조기능사"
        },
        {
          "id": 505,
          "name": "정보처리기능사"
        },
        {
          "id": 506,
          "name": "동력기계정비기능사"
        },
        {
          "id": 507,
          "name": "측량기능사"
        },
        {
          "id": 508,
          "name": "석공기능사"
        },
        {
          "id": 509,
          "name": "철도토목기능사"
        },
        {
          "id": 510,
          "name": "콘크리트기능사"
        },
        {
          "id": 511,
          "name": "방수기능사"
        },
        {
          "id": 512,
          "name": "전산응용건축제도기능사"
        },
        {
          "id": 513,
          "name": "조적기능사"
        },
        {
          "id": 514,
          "name": "전산응용토목제도기능사"
        },
        {
          "id": 515,
          "name": "철근기능사"
        },
        {
          "id": 516,
          "name": "금속재창호기능사"
        },
        {
          "id": 517,
          "name": "플라스틱창호기능사"
        },
        {
          "id": 518,
          "name": "미장기능사"
        },
        {
          "id": 519,
          "name": "신재생에너지발전설비기능사(태양광)"
        },
        {
          "id": 520,
          "name": "비계기능사"
        },
        {
          "id": 521,
          "name": "기계정비기능사"
        },
        {
          "id": 522,
          "name": "건축목공기능사"
        },
        {
          "id": 523,
          "name": "건설재료시험기능사"
        },
        {
          "id": 524,
          "name": "가구제작기능사"
        },
        {
          "id": 525,
          "name": "건축도장기능사"
        },
        {
          "id": 526,
          "name": "유리시공기능사"
        },
        {
          "id": 527,
          "name": "실내건축기능사"
        },
        {
          "id": 528,
          "name": "온수온돌기능사"
        },
        {
          "id": 529,
          "name": "거푸집기능사"
        },
        {
          "id": 530,
          "name": "도배기능사"
        },
        {
          "id": 531,
          "name": "타일기능사"
        },
        {
          "id": 532,
          "name": "염색기능사(침염)"
        },
        {
          "id": 533,
          "name": "염색기능사(날염)"
        },
        {
          "id": 534,
          "name": "시추기능사"
        },
        {
          "id": 535,
          "name": "광산보안기능사"
        },
        {
          "id": 536,
          "name": "금속도장기능사"
        },
        {
          "id": 537,
          "name": "귀금속가공기능사"
        },
        {
          "id": 538,
          "name": "방사선비파괴검사기능사"
        },
        {
          "id": 539,
          "name": "초음파비파괴검사기능사"
        },
        {
          "id": 540,
          "name": "자기비파괴검사기능사"
        },
        {
          "id": 541,
          "name": "침투비파괴검사기능사"
        },
        {
          "id": 542,
          "name": "목공예기능사"
        },
        {
          "id": 543,
          "name": "축산기능사"
        },
        {
          "id": 544,
          "name": "식육처리기능사"
        },
        {
          "id": 545,
          "name": "천공기운전기능사"
        },
        {
          "id": 546,
          "name": "인쇄기능사"
        },
        {
          "id": 547,
          "name": "식품가공기능사"
        },
        {
          "id": 548,
          "name": "잠수기능사"
        },
        {
          "id": 549,
          "name": "종자기능사"
        },
        {
          "id": 550,
          "name": "화훼장식기능사"
        },
        {
          "id": 551,
          "name": "임업종묘기능사"
        },
        {
          "id": 552,
          "name": "버섯종균기능사"
        },
        {
          "id": 553,
          "name": "산림기능사"
        },
        {
          "id": 554,
          "name": "임산가공기능사"
        },
        {
          "id": 555,
          "name": "지적기능사"
        },
        {
          "id": 556,
          "name": "도화기능사"
        },
        {
          "id": 557,
          "name": "항공사진기능사"
        },
        {
          "id": 558,
          "name": "광학기능사"
        },
        {
          "id": 559,
          "name": "지도제작기능사"
        },
        {
          "id": 560,
          "name": "수산양식기능사"
        },
        {
          "id": 561,
          "name": "한복기능사"
        },
        {
          "id": 562,
          "name": "에너지관리기능사"
        },
        {
          "id": 563,
          "name": "전기기능사"
        },
        {
          "id": 564,
          "name": "3D프린터운용기능사"
        },
        {
          "id": 565,
          "name": "사진기능사"
        },
        {
          "id": 566,
          "name": "컴퓨터그래픽스운용기능사"
        },
        {
          "id": 567,
          "name": "웹디자인기능사"
        },
        {
          "id": 568,
          "name": "타워크레인운전기능사"
        },
        {
          "id": 569,
          "name": "컨테이너크레인운전기능사"
        },
        {
          "id": 570,
          "name": "기중기운전기능사"
        },
        {
          "id": 571,
          "name": "굴삭기운전기능사"
        },
        {
          "id": 572,
          "name": "불도저운전기능사"
        },
        {
          "id": 573,
          "name": "천장크레인운전기능사"
        },
        {
          "id": 574,
          "name": "로더운전기능사"
        },
        {
          "id": 575,
          "name": "롤러운전기능사"
        },
        {
          "id": 576,
          "name": "지게차운전기능사"
        },
        {
          "id": 577,
          "name": "광고도장기능사"
        },
        {
          "id": 578,
          "name": "보석가공기능사"
        },
        {
          "id": 579,
          "name": "도자공예기능사"
        },
        {
          "id": 580,
          "name": "제과기능사"
        },
        {
          "id": 581,
          "name": "제빵기능사"
        },
        {
          "id": 582,
          "name": "조경기능사"
        },
        {
          "id": 583,
          "name": "원예기능사"
        },
        {
          "id": 584,
          "name": "신발류제조기능사"
        },
        {
          "id": 585,
          "name": "이용사"
        },
        {
          "id": 586,
          "name": "한식조리기능사"
        },
        {
          "id": 587,
          "name": "양식조리기능사"
        },
        {
          "id": 588,
          "name": "일식조리기능사"
        },
        {
          "id": 589,
          "name": "중식조리기능사"
        },
        {
          "id": 590,
          "name": "복어조리기능사"
        },
        {
          "id": 591,
          "name": "조주기능사"
        },
        {
          "id": 592,
          "name": "피아노조율기능사"
        },
        {
          "id": 593,
          "name": "환경기능사"
        },
        {
          "id": 594,
          "name": "영사기능사"
        },
        {
          "id": 595,
          "name": "양화장치운전기능사"
        },
        {
          "id": 596,
          "name": "양복기능사"
        },
        {
          "id": 597,
          "name": "양장기능사"
        },
        {
          "id": 598,
          "name": "미용사(일반)"
        },
        {
          "id": 599,
          "name": "승강기기능사"
        },
        {
          "id": 600,
          "name": "미용사(피부)"
        },
        {
          "id": 601,
          "name": "미용사(네일)"
        },
        {
          "id": 602,
          "name": "세탁기능사"
        },
        {
          "id": 603,
          "name": "미용사(메이크업)"
        },
        {
          "id": 604,
          "name": "화약취급기능사"
        },
        {
          "id": 605,
          "name": "보석감정사"
        },
        {
          "id": 606,
          "name": "떡제조기능사"
        },
        {
          "id": 607,
          "name": "국제의료관광코디네이터"
        },
        {
          "id": 608,
          "name": "직업상담사1급"
        },
        {
          "id": 609,
          "name": "직업상담사2급"
        },
        {
          "id": 610,
          "name": "사회조사분석사1급"
        },
        {
          "id": 611,
          "name": "사회조사분석사2급"
        },
        {
          "id": 612,
          "name": "전자상거래관리사1급"
        },
        {
          "id": 613,
          "name": "컨벤션기획사1급"
        },
        {
          "id": 614,
          "name": "컨벤션기획사2급"
        },
        {
          "id": 615,
          "name": "소비자전문상담사1급"
        },
        {
          "id": 616,
          "name": "소비자전문상담사2급"
        },
        {
          "id": 617,
          "name": "임상심리사1급"
        },
        {
          "id": 618,
          "name": "임상심리사2급"
        },
        {
          "id": 619,
          "name": "텔레마케팅관리사"
        },
        {
          "id": 620,
          "name": "멀티미디어콘텐츠제작전문가"
        },
        {
          "id": 621,
          "name": "스포츠경영관리사"
        },
        {
          "id": 622,
          "name": "컴퓨터활용능력1급"
        },
        {
          "id": 623,
          "name": "컴퓨터활용능력2급"
        },
        {
          "id": 624,
          "name": "전산회계운용사1급"
        },
        {
          "id": 625,
          "name": "전산회계운용사2급"
        },
        {
          "id": 626,
          "name": "전산회계운용사3급"
        },
        {
          "id": 627,
          "name": "비서1급"
        },
        {
          "id": 628,
          "name": "비서2급"
        },
        {
          "id": 629,
          "name": "비서3급"
        },
        {
          "id": 630,
          "name": "전자상거래운용사"
        },
        {
          "id": 631,
          "name": "워드프로세서"
        },
        {
          "id": 632,
          "name": "한글속기1급"
        },
        {
          "id": 633,
          "name": "한글속기2급"
        },
        {
          "id": 634,
          "name": "한글속기3급"
        },
        {
          "id": 635,
          "name": "기록물관리 전문요원"
        },
        {
          "id": 636,
          "name": "기업재난관리사"
        },
        {
          "id": 637,
          "name": "1급 산림치유지도사"
        },
        {
          "id": 638,
          "name": "2급 산림치유지도사"
        },
        {
          "id": 639,
          "name": "나무의사"
        },
        {
          "id": 640,
          "name": "목구조관리기술자"
        },
        {
          "id": 641,
          "name": "목구조시공기술자"
        },
        {
          "id": 642,
          "name": "산림교육전문가"
        },
        {
          "id": 643,
          "name": "수목치료기술자"
        },
        {
          "id": 644,
          "name": "간호사"
        },
        {
          "id": 645,
          "name": "간호조무사"
        },
        {
          "id": 646,
          "name": "물리치료사"
        },
        {
          "id": 647,
          "name": "방사선사"
        },
        {
          "id": 648,
          "name": "보건교육사"
        },
        {
          "id": 649,
          "name": "보건의료정보관리사"
        },
        {
          "id": 650,
          "name": "보육교사"
        },
        {
          "id": 651,
          "name": "보조공학사"
        },
        {
          "id": 652,
          "name": "안경사"
        },
        {
          "id": 653,
          "name": "안마사"
        },
        {
          "id": 654,
          "name": "약사"
        },
        {
          "id": 655,
          "name": "언어재활사"
        },
        {
          "id": 656,
          "name": "영양사"
        },
        {
          "id": 657,
          "name": "요양보호사"
        },
        {
          "id": 658,
          "name": "위생사"
        },
        {
          "id": 659,
          "name": "응급구조사"
        },
        {
          "id": 660,
          "name": "의사"
        },
        {
          "id": 661,
          "name": "의지보조기기사"
        },
        {
          "id": 662,
          "name": "임상병리사"
        },
        {
          "id": 663,
          "name": "작업치료사"
        },
        {
          "id": 664,
          "name": "장례지도사"
        },
        {
          "id": 665,
          "name": "장애인재활상담사"
        },
        {
          "id": 666,
          "name": "정신건강간호사"
        },
        {
          "id": 667,
          "name": "정신건강사회복지사"
        },
        {
          "id": 668,
          "name": "정신보건임상심리사"
        },
        {
          "id": 669,
          "name": "조산사"
        },
        {
          "id": 670,
          "name": "치과기공사"
        },
        {
          "id": 671,
          "name": "치과위생사"
        },
        {
          "id": 672,
          "name": "치과의사"
        },
        {
          "id": 673,
          "name": "한약사"
        },
        {
          "id": 674,
          "name": "한약조제사"
        },
        {
          "id": 675,
          "name": "한의사"
        },
        {
          "id": 676,
          "name": "사회환경교육지도사2급"
        },
        {
          "id": 677,
          "name": "사회환경교육지도사3급"
        },
        {
          "id": 678,
          "name": "환경영향평가사"
        },
        {
          "id": 679,
          "name": "환경측정분석사"
        },
        {
          "id": 680,
          "name": "직업능력개발훈련교사"
        },
        {
          "id": 681,
          "name": "고속구조정 조종사"
        },
        {
          "id": 682,
          "name": "구명정 조종사"
        },
        {
          "id": 683,
          "name": "기관사"
        },
        {
          "id": 684,
          "name": "도선사"
        },
        {
          "id": 685,
          "name": "소형선박조종사"
        },
        {
          "id": 686,
          "name": "수면비행선박조종사"
        },
        {
          "id": 687,
          "name": "수산질병관리사"
        },
        {
          "id": 688,
          "name": "운항사"
        },
        {
          "id": 689,
          "name": "통신사"
        },
        {
          "id": 690,
          "name": "항해사"
        },
        {
          "id": 691,
          "name": "자동차운전기능검정원"
        },
        {
          "id": 692,
          "name": "자동차운전면허"
        },
        {
          "id": 693,
          "name": "자동차운전전문강사"
        },
        {
          "id": 694,
          "name": "1급 생활스포츠지도사"
        },
        {
          "id": 695,
          "name": "1급 장애인스포츠지도사"
        },
        {
          "id": 696,
          "name": "1급 전문스포츠지도사"
        },
        {
          "id": 697,
          "name": "2급 생활스포츠지도사"
        },
        {
          "id": 698,
          "name": "2급 장애인스포츠지도사"
        },
        {
          "id": 699,
          "name": "2급 전문스포츠지도사"
        },
        {
          "id": 700,
          "name": "건강운동관리사"
        },
        {
          "id": 701,
          "name": "경주심판"
        },
        {
          "id": 702,
          "name": "노인스포츠지도사"
        },
        {
          "id": 703,
          "name": "무대예술전문인"
        },
        {
          "id": 704,
          "name": "문화예술교육사"
        },
        {
          "id": 705,
          "name": "사서"
        },
        {
          "id": 706,
          "name": "유소년스포츠지도사"
        },
        {
          "id": 707,
          "name": "무선통신사"
        },
        {
          "id": 708,
          "name": "아마추어무선기사"
        },
        {
          "id": 709,
          "name": "보세사"
        },
        {
          "id": 710,
          "name": "원자로조종감독자면허"
        },
        {
          "id": 711,
          "name": "원자로조종사면허"
        },
        {
          "id": 712,
          "name": "핵연료물질취급면허 [감독자]"
        },
        {
          "id": 713,
          "name": "핵연료물질취급면허 [취급자]"
        },
        {
          "id": 714,
          "name": "가축인공수정사"
        },
        {
          "id": 715,
          "name": "농산물검사원"
        },
        {
          "id": 716,
          "name": "말조련사"
        },
        {
          "id": 717,
          "name": "수의사"
        },
        {
          "id": 718,
          "name": "장제사"
        },
        {
          "id": 719,
          "name": "재활승마지도사"
        },
        {
          "id": 720,
          "name": "유통관리사"
        },
        {
          "id": 721,
          "name": "건축물에너지평가사"
        },
        {
          "id": 722,
          "name": "건축사"
        },
        {
          "id": 723,
          "name": "건축사(예비)"
        },
        {
          "id": 724,
          "name": "교통안전관리자"
        },
        {
          "id": 725,
          "name": "버스운전자"
        },
        {
          "id": 726,
          "name": "사업용 조종사"
        },
        {
          "id": 727,
          "name": "운송용 조종사"
        },
        {
          "id": 728,
          "name": "자가용 조종사"
        },
        {
          "id": 729,
          "name": "철도차량운전면허"
        },
        {
          "id": 730,
          "name": "초경량비행장치 조종자"
        },
        {
          "id": 731,
          "name": "택시운전자격"
        },
        {
          "id": 732,
          "name": "항공교통관제사"
        },
        {
          "id": 733,
          "name": "항공기관사"
        },
        {
          "id": 734,
          "name": "항공사"
        },
        {
          "id": 735,
          "name": "항공운항관리사"
        },
        {
          "id": 736,
          "name": "항공정비사"
        },
        {
          "id": 737,
          "name": "화물운송종사자"
        },
        {
          "id": 738,
          "name": "보건교사"
        },
        {
          "id": 739,
          "name": "사서교사"
        },
        {
          "id": 740,
          "name": "실기교사"
        },
        {
          "id": 741,
          "name": "영양교사"
        },
        {
          "id": 742,
          "name": "전문상담교사"
        },
        {
          "id": 743,
          "name": "정교사"
        },
        {
          "id": 744,
          "name": "준교사"
        },
        {
          "id": 745,
          "name": "평생교육사"
        },
        {
          "id": 746,
          "name": "1급 소방안전관리자"
        },
        {
          "id": 747,
          "name": "2급 소방안전관리자"
        },
        {
          "id": 748,
          "name": "3급 소방안전관리자"
        },
        {
          "id": 749,
          "name": "특급 소방안전관리자"
        },
        {
          "id": 750,
          "name": "주류제조관리사"
        },
        {
          "id": 751,
          "name": "동력수상레저기구조종면허"
        },
        {
          "id": 752,
          "name": "변호사"
        },
        {
          "id": 753,
          "name": "법무사"
        },
        {
          "id": 754,
          "name": "공인회계사"
        },
        {
          "id": 755,
          "name": "보험계리사"
        },
        {
          "id": 756,
          "name": "보험중개사"
        },
        {
          "id": 757,
          "name": "손해사정사"
        }
      ]
  };


  render() {
    let { data } = this.state;
    return (
      <div className="UseAutoComplete">
        <SearchBar data={data} />
      </div>
    );
  }
}

export default UseAutoComplete;